<?php
$abc = 88 ;                          //設定變數前要加$
$cba = "10" ;                        //加引號裡面還有數字就可以被讀到
$c = "100豪豪ㄘ789" ;                //引號裡面在國字之後的字都會變0
echo 33456789 ."<br>"   ;            //數字可以直接宣告
echo "超級豪蚌蚌"  ."<br>";
echo $abc  ."<br>"  ; 
echo "<br><br>" ;                               // <br>跳格符號 要使用記得要用echo"<br>" 
echo "<br>"."-------------------------"."<br>"; 

echo $c = "100豪豪ㄘ" ;    
echo $abc + $cba + $c ;              //加引號裡面還有數字就可以被讀到、引號裡面在國字之後的字都會變0

echo "<br>"."-------------------------"."<br>"; 

$w = 123;
$r = 500;
echo $w."p" + $r."O";                //因為字串在運算式中間所以被當成0

echo "<br>"."-------------------------"."<br>"; 

echo $_SERVER["REMOTE_ADDR"]."<br>";         //IP位置 
echo $_SERVER["QUERY_STRING"]."<br>";        //在網址後方加入?之後可以隨意加入自己想要的字
echo $_SERVER["SERVER_PORT"]."<br>";         //PORT

echo "<br>"."-------------------------"."<br>"; 

$a[0] = "aaa" ;          //PHP陣列變數
echo $a[0] ."<br>"; 

$b[] = 1 ;               //用for迴圈echo陣列裡的值
$b[] = 2 ;
$b[] = 3 ;
$b[] = 4 ;
$b[] = 5 ;
for($i = 0 ; $i < 5 ; $i++)
{
echo $b[$i];                    
}
echo "<br>"."<br>";

echo "<br>"."-------------------------"."<br>";

for($i = 5 ; $i > 0 ; $i--)     //用for迴圈畫星星
{
     for($j = 0 ; $i+$j <= 5 ; $j++)
     {
      echo "*";
     }  
 echo "<br>";
}
for($i = 0 ; $i < 5 ; $i++)     //用for迴圈畫星星
{
     for($j = 0 ; $i+$j < 4 ; $j++)
     {
      echo "*";
     }  
 echo "<br>";
}
echo "-------------------------"."<br>";

for($i = 0 ; $i < 4 ; $i++)
{
  for( $j=3 ; ($j-$i)>0 ; $j-- )
  {
  echo "&nbsp";     //若輸出" " 其實是有空格的 但是網頁過濾掉了 必須要用&nbsp才行
  }
  for( $k=0 ; ($i*2) - $k >= 0 ; $k++ )
  {
  echo "*";
  }
 echo "<br>";
}

for($i = 3 ; $i > 0 ; $i--)
{
  for( $j=3 ; ($j-$i)>=0 ; $j-- )
  {
  echo "&nbsp";
  }
  for( $k=1 ; ($i*2) - $k > 0 ; $k++ )
  {
  echo "*";
  }
 echo "<br>";
}


echo "<br>"."-------------------------"."<br>";

$ccc[1][1]="a";
$ccc[2][1]="s";
$ccc[3][1]="v";
$ccc[4][1]="c";
$ccc[5][1]="x";
$ccc[6][1]="z";
$ccc[7][1]="d";
$ccc[1][]="w";
$ccc[2][]="ed";
$ccc[3][]="g";
$ccc[4][]="y";
$ccc[5][]="t";
$ccc[6][]="w";
$ccc[7][]="q";
$ccc[1][]="w";
$ccc[2][]="e";
$ccc[3][]="ef";
$ccc[4][]="j";
$ccc[5][]="t";
$ccc[6][]="r";
$ccc[7][]="y";
$ccc[1][]="i";
$ccc[2][]="u";
$ccc[3][]="w";
$ccc[4][]="y";
$ccc[5][]="o";
$ccc[6][]="p";
$ccc[7][]="y"; 

for( $i=1 ; $i<=7 ; $i++)
{
        for( $j = 1 ; $j<=4 ; $j++)
        {
            echo $ccc[$i][$j]."　";
        }
        echo "<br>"   ;
}

echo "<br>"."-------------------------"."<br>";

for( $i=1 ; $i<=9 ; $i++)
{
       for( $j=1 ; $j<=9 ; $j++ )
       {
       echo $i."x".$j."=".($i*$j)."　" ;
       }
       echo "<br>";
}

echo "<br>"."-------------------------"."<br>";
?>